create database account;
use account;

-- 创建账号密码表
create table user(
	username char(8),
    password char(24),
    identity char(6),
    primary key(username)
)DEFAULT CHARACTER SET utf8;


insert into user values('1200','12345678','管理员'),
('1201','12345678','教师'),
('1203','12345678','教师'),
('1204','12345678','教师'),
('1205','12345678','教师'),
('1206','12345678','教师'),
('19120001','12345678','学生'),
('19120002','12345678','学生'),
('19120003','12345678','学生'),
('19120004','12345678','学生'),
('19120005','12345678','学生'),
('19120006','12345678','学生'),
('19120007','12345678','学生'),
('19120008','12345678','学生'),
('19120009','12345678','学生'),

select * from user;