use course_selection

-- 初始化学生表
INSERT INTO student VALUES('19120001','李铭','男',19,'计算机软件',0),
('19120002','刘晓鸣','男',20,'计算机应用',0),
('19120003','李明','男',22,'计算机应用',0),
('19120004','张鹰','女',21,'计算机软件',0),
('19120005','刘竟静','女',22,'计算机软件',0),
('19120006','刘成刚','男',21,'计算机软件',0),
('19120007','王铭','男',22,'计算机应用',0),
('19120008','宣明尼','女',18,'计算机应用',0),
('19120009','柳红利','女',19,'计算机软件',0);

SELECT * FROM student;
-- 初始化教师表
INSERT INTO teacher VALUES('1200','管理员',NULL,'系统管理员'),
('1201','王晓名','计算机应用','教师'),
('1202','刘红','计算机软件','教师'),
('1203','吴志钢','计算机应用','教师'),
('1204','李严劲','计算机软件','教师'),
('1205','蒋莹岳','计算机应用','教师')

SELECT * FROM teacher;

-- 初始化课程表
INSERT INTO course VALUES('01','Pascal',4,'计算机应用','1201'),
('02','数据结构',4,'计算机应用','1202'),
('03','离散数学',4,'计算机应用','1203'),
('04','计算机原理',6,'计算机软件','1204'),
('05','数据库原理',4,'计算机应用','1203'),
('06','Windows技术',4,'计算机软件','1203'),
('07','编译原理',4,'计算机软件','1205'),
('08','系统结构',6,'计算机应用','1202')

SELECT * FROM course;

-- 初始化选课表
INSERT INTO selection VALUES('19120001','02',56,0),
('19120001','04',78,3),
('19120001','06',66,1.7),
('19120001','08',88,3.7),
('19120003','01',88,3.7),
('19120003','02',76,2.7),
('19120004','01',67,1.7),
('19120004','02',76,2.7),
('19120004','03',67,1.7),
('19120005','01',67,1.7),
('19120005','02',78,3),
('19120005','03',91,4),
('19120006','01',78,3)

select * from selection;



